run/CHT/openFuelCell/system/controlDict.mesh
/*---------------------------------------------------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Copyright held by the original author
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          controlDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     chtFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         5;

deltaT          1;

writeControl    adjustableRunTime;
writeInterval   5;
//writeControl    timeStep;
//writeInterval   20;

purgeWrite      0;

writeFormat     ascii;

writePrecision  7;

writeCompression  off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

maxCo           0.3;

adjustTimeStep  yes;


// ************************************************************************* //
