run/CHT/openFuelCell/system/decomposeParDict
/*---------------------------------------------------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Copyright held by the original author
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 4;		//numberOfSubdomains= nx*ny*nz

method              manual;	

simpleCoeffs
{
    n               (20 1 1);
    delta           0.001;
}

hierarchicalCoeffs
{
    n               (20 1 1);
    delta           0.001;
    order           xyz;
}

metisCoeffs
{
    processorWeights 
    (
        1
        1
    );
}

manualCoeffs
{
    dataFile        "cellID";
}

distributed     no;

roots           
(
);

// ************************************************************************* //
