run/CHT/openFuelCell/system/fvSolution
/*---------------------------------------------------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Copyright held by the original author
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          fvSolution;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    T
    {
        solver           PBiCGStab;
        preconditioner
        {
            preconditioner  GAMG;
            tolerance       1e-12;
            relTol          0;
            smoother        DILU;//GaussSeidel;
            nPreSweeps      0;
            nPostSweeps     2;
            nFinestSweeps   2;
            cacheAgglomeration false;
            nCellsInCoarsestLevel 10;
            agglomerator    assembledFaceAreaPair;
            mergeLevels     1;
        }
        tolerance       1e-10;
        relTol          0;

        maxIter         100;
    }
}

relaxationFactors
{
    //T               0.9999;
}


// ************************************************************************* //
